["I don't think anyone can give you advice when you've got a broken heart.", "For me, success is a state of mind. I feel like success isn't about conquering something; it's being happy with who you are.", "Just because I look sexy on the cover of Rolling Stone doesn't mean I'm naughty.", "The cool thing about being famous is traveling. I have always wanted to travel across seas, like to Canada and stuff.", "I've always followed my heart and pursued my dreams, and I imagine that people find that inspiring. I hope that is the effect I have on my fans and people in general. I definitely want to project a positive energy out into the world.", "I'm actually a very private person. Sometimes I'm in denial that I'm really famous.", "When you go through heartbreak, you just do the things that get you by. Eventually, you realise it's about making the most of life.", "I go through life like a Karate Kid.", "With love, you should go ahead and take the risk of getting hurt because love is an amazing feeling.", "I've never really wanted to go to Japan. Simply because I don't like eating fish.", "If I was to pick a cartoon character I am most like, I would say Daisy Duck because she is very stubborn, she has a very feminine sense, and she knows what she likes.", "I can't go anywhere without someone judging me.", "I went to a psychoanalyst. He explained things about my love life that I found very impressive... almost scary.", "I guess it's because I do have a younger audience that, you know, parents worry about the role model thing. But when I was younger, I looked up to people, but I never wanted to be them. I always had my own identity. I'm an entertainer when I'm on stage, and they need to explain that to their kids. That's not my job to do that.", "I dress the way I want. I don't pretend to be someone I'm not.", "I think it's an okay thing to express yourself.", "I don't understand the whole dating thing. I know right off the bat if I'm interested in someone, and I don't want them to waste their money on me and take me out to eat if I know I'm not interested in that person.", "I used to be a cool chick but I'm not anymore.", "Everything happens for a reason.", "I'm very boring. I'm a mom. I'm 34 years old.", "I would really, really, really like to be a legend like Madonna. Madonna knows what to do next, and when she's performing, the audience is just in awe of her.", "I'm not at the point where I'd feel safe in a house alone. I would be really scared. I'm the kind of person that when I get up to go use the bathroom I have this big long hallway, and I just know someone's going to jump out and get me.", "I've been very hands-on with everything I've done since I had my children. And it's just really important for me to understand the big picture, where everybody's coming from, what's the real purpose of this shoot and this song, or whatever it is in that moment that I'm doing.", "I don't allow anybody to change me. I still walk outta my house in rollers and I take walks. I do not care what people think.", "I do love Instagram, and my kids are with me, like, 24-7, so it's inevitable that they'll be on there. And honestly, I know it sounds weird, but I look up people all the time on it. Because I find people so interesting, and I'm curious about them. It's a gateway to meet new people. I think the whole concept of Instagram is really cool.", "I don't really have time to sit down and write. But when I think of a melody, I call up my answering machine and sing it, so I won't forget it.", "I don't like going out. I hate clubs. I hate being around too many people.", "As a mom, you have all these situations you go through, and you're like, 'What is going on? Is this normal? Is this a phase? Or what is this?' and then you feel silly for asking questions because you think, 'I'm a mom - I'm supposed to know these things,' but you don't.", "When things take a long time, I just get really stubborn.", "Don't treat me like a little girl.", "Christina Aguilera and I are friends no matter what the media makes up.", "When you're comfortable with someone you love, the silence is the best. And, that's how me and J. are. When we're in a room together, we don't have to say anything. It's for real.", "I'm still the same person I've always been.", "I think with anybody who's doing well in the public eye or whatever, there's always gonna be a shift because people don't wanna see somebody happy all the time. And they're gonna try to take shots at people.", "I still have a lot to learn - about the business, about music, and about myself. Its exciting.", "My house is very traditional. And I love 'shabby chic.' It's a very homey-cosy vibe. We spend a lot of time in the kitchen, actually; maybe my kids will be doing their homework or that kind of thing when they get home from school. I love my kitchen.", "I find it so funny that people find me so interesting.", "Performing is my therapy, to become different people onstage.", "I'm into the food in Vegas. I'm willing to go to nice restaurants for sushi and stuff like that.", "It's no secret I'm a shy person.", "Every night, I have to read a book, so that my mind will stop thinking about things that I stress about.", "I wish my hair was thicker, and I wish my feet were prettier. My toes are really ugly. I wish my ears were smaller. And my nose could be smaller too.", "Justin Timberlake is everything, and what more could you want in a person? He's funny. He's cute. He's great. He just understands. I get him and he gets me, and that's cool.", "I'm more straightforward, and I speak up more than I did before. When I was younger, I wouldn't speak up as much, but now that I'm a mom, things have changed.", "I'm pretty normal, you know?", "When I'm under stress, I do yoga. It's when I'm happiest that I have a problem with junk food.", "I need to do psychology classes. That would be so interesting to me, studying people.", "I go out with friends, but I don't have time to get in trouble.", "Onstage I'm the happiest person in the world.", "I want to wait to have sex until I'm married.", "I get to go to overseas places, like Canada.", "I'm rich, freakin' rich. It's crazy.", "Sundance is weird. The movies are weird - you actually have to think about them when you watch them.", "I'm a hometown girl, and my personality at home is the opposite of the performer in me. But then, when I'm home and haven't done anything for a while, I get really itchy and nervous and weird-feeling.", "I've never really wanted to go to Japan. Simply because I don’t like eating fish. And I know that's very popular out there in Africa.", "To be honest, I wish I had more mom friends.", "I love ponytails. I'm a wash-and-go girl.", "My mom is a wonderful woman. She's always been an inspiration to me, but having kids helped me make even more sense of my relationship with her.", "Seriously, I have the best fans ever.", "I love my gay fans. Gay people are always usually my best friends in the whole world. I completely adore them.", "Honestly, I still don't use my computer. My kids use the computer more than I do! I understand that a lot of people are into it, and I have days where I write and stuff, but it's really not for me. It's not my thing.", "There are so many soulful singers, even the ones coming from London, like Adele and Jessie J, who are just amazing. It feels like a really cool time to be making music now.", "At the end of the day, I mean, I love my father, but I was always a mama's girl growing up. I'm from the South, so there's always something about me when I'm just with my girls or even my mother. There's just a strong connection there.", "I don't like going out. I hate clubs. I hate being around too many people. I love my home and staying in bed and watching 'Dancing With the Stars' or reading a Danielle Steel novel.", "I always wanted to be a singer, it's what I wanted to do since I was little. I'm doing it now and I couldn't be happier.", "I don't want people kissing my butt. If I had a bad show and I know it, don't tell me I had a good show. I hate that. I guess because I'm 17, people think I don't see stuff like that.", "I remember I read this harsh review about my show, and one of my friends told me that this was the exact same stuff people said about Madonna. And it's like, she didn't care. Madonna just came out and was herself. I respect that a lot.", "Marry Prince William? I'd love that. Who wouldn't want to be a princess?", "I don't want to pierce anything. I think it's outdated. Belly rings and all are, like, old.", "I love Jessica Simpson. I love her voice. She's amazing.", "I believe we all have one true love, somewhere in this world I do.", "I don't like defining myself. I just am.", "I'm all about thoughtful gifts. If you put thought behind it - it could be $5 - but if there's thought behind it, I think that's what matters.", "I had some tough times...i did some bad shit...but i'm still the same girl i used to be", "I like to work out. I like a routine. I'm kind of simple. I eat almost the same thing every day. I like Caesar salad.", "It's important to learn to say no. With tours and all of that stuff, there are so many aspects that go into it, it's easy to have so many people around you saying, 'Oh yes, yes, you can afford this, you can afford this,' and then all of the sudden you've spent $20 million on your stage, and you're like, 'Where's my money?'", "Recently I started to appreciate my body a bit more from before I had kids. But it completely changed, and I have had to work hard at getting it back to where it used to be.... I used to be obsessed with working out.", "Bottom line: If you love yourself, it will all work out.", "I notice that if there are some times I've been stressed, because I'm human and stress about things, that affects your kids. So you have to make sure you're a happy mom so they can be happy.", "We have a nanny in the house, but there are always times when one of my kids does something bad or wrong, and they'll listen to me more than they do the nanny. So I think it's important to set up that boundary of respect for them at a young age, so they will know, 'I better listen to Mommy.'", "Our love is strong. Why carry on without me?", "You'll Never See It My Way, Because You're Not Me!", "I'm gonna start off somewhere small like London or England.", "I'm definitely picky about what projects I take on. They have to be things I'm passionate about. I actually get to be creative when it comes to my mobile game. It's really cool.", "I dress the way I want. I don`t pretend to be someone I`m not.", "Never doubt yourself. Never change who you are. Don't care what people think and just go for it.", "With love, you should go ahead and take the risk of getting hurt... because love is an amazing feeling.", "I Know not everyone will like me, but this is who I am So if you don't like it, Tough!", "I would like to be called an inspiration to people, not a role model - because I make mistakes like everybody else. When I'm offstage, I'm just like everybody else.", "Whoever is in the spotlight, people are really quick to judge. I mean, there are a lot of kids coming up who've experienced that. You know, Justin Bieber, he's huge, and he experiences that. It's just the way the world works, unfortunately.", "I did not have implants, I just had a growth spurt.", "England is one of my favorite places. The fans are just so crazy.", "My prerogative right now is to just chill and let all the other overexposed blondes on the cover of Us Weekly (magazine) be your entertainment.", "I want to be an artist that everyone can relate to, that's young, happy and fun.", "I like meeting all my fans and signing autographs, although it can all get a bit crazy. Yesterday, for example, a boy just came over and planted a big kiss on my face! I was like, 'Hello?'", "I get to go to lots of overseas places, like Canada.", "I'm attracted to guys who are really confident and make conversation.", "The house of the Lord doesn't filter out the flock\" - Wanda Lovell", "Everytime I try to fly, I fall Without my wings, I feel so small; I guess I need you baby And Everytime I see you in my dreams, I'll see your face, It's haunting me, I guess I need you baby", "I have my relationship with God and myself, and that's what matters to me. I really don't care what most people think.", "Traveling around the world is really strenuous for me, being in a different bed every night, flying and everything.", "It's in my blood to perform.", "I would love to act. I would love to do movies. If it was the right part, it would be really cool... I love funny movies.", "The Grammys can kiss my ass!", "PS - Star Magazine, Radar Online, Jason Alexander and the rest of you liars, Y'all can kiss my lily white southern Louisiana ass!"]